
%%
%----------------------------------------------------------------------------------%
%  1-DÐÅºÅÑ¹Ëõ´«¸ÐµÄÊµÏÖ(l1-MAGICºÍl1_ls½âl1ÎÊÌâ)   
%  ²âÁ¿ÊýM>=K*log(N/K),KÊÇÏ¡Êè¶È,NÐÅºÅ³¤¶È,¿ÉÒÔ½üºõÍêÈ«ÖØ¹¹
%  ±à³ÌÈË--Î÷ÄÏ½»Í¨´óÑ§Ç£Òý¶¯Á¦¹ú¼ÒÖØµãÊµÑéÊÒ ºÎÁõ  Email: aresmiki@163.com
%  ±à³ÌÊ±¼ä£º2017Äê04ÔÂ27ÈÕ
%---------------------------------------------------------------------------------%
clc;clear all;close all;
%% 1. ²úÉúÏ¡ÊèµÄÐÅºÅ
N=1024;
K=50;
x=zeros(N,1);
rand('state',8)
q=randperm(N); %Ëæ»úÅÅÁÐ1µ½NµÄÕûÊý
randn('state',10)
x(q(1:K))=randn(K,1); %½«K¸öËæ»úÊýËæ»ú·Åµ½xÖÐ
t=0:N-1;
%% 2. ¹¹Ôì¸ÐÖª¾ØÕó
M=2*ceil(K*log(N/K));
Phi=randn(M,N);  %¸ßË¹¾ØÕó×÷Îª¸ÐÖª¾ØÕó
Phi=orth(Phi')';  %Õý½»»¯
% Phi=(sqrt(N))*eye(M)*Phi;
Psi=(sqrt(N))*eye(N,N);  %¾ØÕóPsi¹¹Ôì£¬Ê¹µÃÐÅºÅxÏ¡Êè£¬ÓÉÓÚx±¾Éí¾ÍÊÇÏ¡ÊèµÄ£¬ËùÒÔÕâÀï¾ÍÊÇµ¥Î»²ÉÑù¾ØÕó

%% 3. Á¿²âÐÅºÅ
y=Phi*x;
%% 4. ÖØ¹¹ÐÅºÅ l1×îÐ¡»¯   Using  l1-MAGIC
% A=Phi;   %»Ö¸´¾ØÕó,Ï¡Êè»¯¾ØÕóÎªµ¥Î»¾ØÕó£¬ÒòÎªÐÅºÅ±¾Éí¾ÍÊÇÏ¡ÊèµÄ£¬²»ÐèÒª×öÈÎºÎÏ¡Êè±ä»»
A=Phi*Psi';
x0=A'*y;  %×îÐ¡¶þ³Ë½â¹À¼ÆÒ»¸ö³õÊ¼Öµ
xh1=l1eq_pd(x0,A,[],y,1e-3);

%% 5. ÖØ¹¹ÐÅºÅl1×îÐ¡»¯   Using l1_ls
lambda  = 0.01; % ÕýÔò»¯²ÎÊý
rel_tol = 1e-3; % Ä¿±êÏà¶Ô¶ÔÅ¼¼äÏ¶
quiet=1;   %²»Êä³öÖÐ¼ä½á¹û
[xh2,status]=l1_ls(A,y,lambda,rel_tol,quiet);

%% 6.»Ö¸´ÐÅºÅºÍÔ­Ê¼ÐÅºÅ±È½Ï
figure
plot(t,Psi*xh1,'ko',t,x,'r.')
xlim([0,t(end)])
legend('l1-MAGIC»Ö¸´ÐÅºÅ','Ô­Ê¼ÐÅºÅ')

figure
plot(t,Psi*xh2,'ko',t,x,'r.')
xlim([0,t(end)])
legend('l1-ls»Ö¸´ÐÅºÅ','Ô­Ê¼ÐÅºÅ')
